app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC LIMIT 10 OFFSET -10
SELECT COUNT(*) FROM "articles"
---
  def index
    @per_page = 5
    @page = (params[:page] || '1').to_i
    @articles = Article.limit(@per_page).offset((@page - 1) * @per_page).order('created_at DESC')

INSERT INTO "articles" ("author_id", "body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @article = Article.new(params[:article])

    @article.author = current_user

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "body" = 'Hello this is a blog post
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])