app/controllers/policies_controller.rb

  def index
    @policies = Policy.all
---
SELECT "policies".* FROM "policies"

  def show
    @policy = Policy.find(params[:id])
---
SELECT "policies".* FROM "policies" WHERE "policies"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @policy = Policy.find(params[:id])
---
SELECT "policies".* FROM "policies" WHERE "policies"."id" = $1 LIMIT 1  [["id", "2"]]

  def update
    @policy = Policy.find(params[:id])
---
SELECT "policies".* FROM "policies" WHERE "policies"."id" = $1 LIMIT 1  [["id", "2"]]