app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'finn' LIMIT 1
---
  def create
    if (user = User.find_by_username(params[:username])) && user.authenticate(params[:password])