app/controllers/workflows_controller.rb

  def create
    @workflow = Workflow.new(params[:workflow])
    @workflow.author = current_user

    respond_to do |format|
      if @workflow.save
---
INSERT INTO "workflows" ("author_id", "content_blob_id", "created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", nil], ["content_blob_id", nil], ["created_at", Wed, 03 Jul 2013 09:22:41 UTC +00:00], ["description", nil], ["title", nil], ["updated_at", Wed, 03 Jul 2013 09:22:41 UTC +00:00]]

  def destroy
    @workflow.destroy
---
DELETE FROM "workflows" WHERE "workflows"."id" = $1  [["id", 1]]

  def find_workflow
    @workflow = Workflow.find(params[:id])
---
SELECT "workflows".* FROM "workflows" WHERE "workflows"."id" = $1 LIMIT 1  [["id", "7"]]

  def find_workflows
    @workflows = Workflow.with_privilege(current_user, :view).includes(:author)
---
SELECT "workflows".* FROM "workflows" INNER JOIN "policies" ON "policies"."id" = "workflows"."policy_id" INNER JOIN "permissions" ON "permissions"."policy_id" = "policies"."id" WHERE (permissions.privilege >= 1 AND (