app/views/policies/_privilege_table.html.erb

SELECT "permissions".* FROM "permissions" WHERE "permissions"."policy_id" = 1
---
  </tr>
  <% policy.permissions(:include => :for).each do |permission| %>