app/views/policies/index.html.erb

SELECT COUNT(*) FROM "permissions" WHERE "permissions"."policy_id" = 1
---
    <td><%= policy.title %></td>
    <td><%= policy.permissions.size %></td>